<!DOCTYPE HTML>
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf8" /> 
  <title>网页标题</title>
</head>
<body>
<?php
//假设，有5个灯泡需要管理，需要实现以下功能目标：
//1, 可以指定任意一个灯泡的“当前状态”
//2, 可以打开指定的任意一个灯泡
//3, 可以关闭指定的任意一个灯泡

//首先，需要设定对应的5个常量，代表对应的5个灯泡：
define("D1", 1);	//对应二进制值为： 		00000001
define("D2", 2);	//对应二进制值为：  	00000010
define("D3", 4);	//对应二进制值为：  	00000100
define("D4", 8);	//对应二进制值为：  	00001000
define("D5", 16);	//对应二进制值为：  	00010000

//然后，定义一个变量，该变量就代表这5个灯泡的“任意组合状态”值；
$state = 10;	//其对应二进制值为：  		00001010
				//此时，它其实表示第2和第4个灯亮
$state = 7;		//其对应二进制值为：  		00000111
$state = 17;	//其对应二进制值为：  		00010001
//注意：上述3个赋值，只是表示$state的值可以是“任意的”

//任务1，可以指定任意一个灯泡的“当前状态”；

//需求1a:请输出灯泡1的状态;
if(($state & D1) > 0) {
	echo "<br />灯1是亮的";
}
else {
	echo "<br />灯1是灭的";
}

//需求1b:请输出灯泡2的状态;
if(($state & D2) > 0) {
	echo "<br />灯2是亮的";
}
else {
	echo "<br />灯2是灭的";
}

//需求1c:请输出灯泡3的状态;
if(($state & D3) > 0) {
	echo "<br />灯3是亮的";
}
else {
	echo "<br />灯3是灭的";
}

//需求1d:请输出灯泡4的状态;
if(($state & D4) > 0) {
	echo "<br />灯4是亮的";
}
else {
	echo "<br />灯4是灭的";
}

//做一个所有灯的整体显示：
function ShowAll() {
	echo "<p>";
	for($i = 1; $i <= 5; ++$i) {
		$s = "D" . $i;
		if(($GLOBALS['state'] & constant($s)) > 0) {
			echo "灯{$i}亮,";
		}
		else {
			echo "灯{$i}灭,";			
		}		
	}
	echo "</p>";
}
showAll();

//需求2，可以打开指定的任意灯泡：
?>
</body>
</html>