<!DOCTYPE HTML>
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf8" /> 
  <title>网页标题</title>
</head>
<body>
<?php
$v1 = 123;

//单引号字符串
//其实需要或可以识别的转义符有： \\ \'
$str1 = 'abc\defg\'abcd$v1';
echo $str1;

echo "<hr />";
echo "\n\n\n";

//双引号字符串
//其实需要或可以识别的转义符有： \\ \" \n(换行符) \r(回车符) \t(tab符)
//还有一个： \$,表示“$”符，其实就是取消了其在双引号字符串中的“变量起始含义”
$str2 = "\\abc\"defg \n a\tbcd$v1";
echo $str2;

echo "<hr />";
echo "\n\n\n";

//单引号定界符字符串
//没有转义符，该字符串中的单引号双引号可以直接写出!
$str3 = <<<'ABCD'
这里是单引号字符串的内容！$v1
ABCD;
//说明：
//1.上述标识符是我们自己取的一个类似常量名的“名字”，随便取
//2.该字符串的结束一行，智能出现该标识符本身及一个分号，其他什么都不可以出现！
echo $str3;

echo "<hr />";
echo "\n\n\n";

//双引号定界符字符串
//其实需要或可以识别的转义符有： \\ \n(换行符) \r(回车符) \t(tab符) \$
//可见，该字符串的转移符，跟双引号非常类似！
//也可见，该字符串中的单引号双引号可以直接写出！
$str4 = <<<"ABCD"
abcdefg,这里是字符串的内容！$v1
ABCD;
//说明：
//1.上述标识符是我们自己去的一个类似常量名的“名字”，随便取
//2.该字符串的结束一行，智能出现该标识符本身及一个分号，其他什么都不可以出现！
//3.上述标识符的双引号可以省略（不推荐)
echo $str4;


?>
</body>
</html>